---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointNotInSurface
source: html/4cd3afed-6d17-18bd-7a39-1f324002ccae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointNotInSurface Property

A Point is outside of the Surface boundary. Insert the Point on the boundary instead, and then drag it to the desired location.

## Syntax (C#)
```csharp
public static FailureDefinitionId PointNotInSurface { get; }
```